app/controllers/addresses_controller.rb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
---
  def index
    @addresses = current_user.addresses.all

INSERT INTO "addresses" ("user_id", "consignee_name", "consignee_address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["consignee_name", "1"], ["consignee_address", "1"], ["created_at", 2016-09-29 03:23:41 UTC], ["updated_at", 2016-09-29 03:23:41 UTC]]
---
  def create
    @address = current_user.addresses.new(address_params)

    respond_to do |format|
      if @address.save

DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address.destroy

UPDATE "users" SET "default_address_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["default_address_id", 2], ["updated_at", 2016-09-29 03:45:30 UTC], ["id", 1]]
---
  def make_it_default
    current_user.default_address_id = @address.id
    current_user.save

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = ? AND "addresses"."id" = ? LIMIT ?  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
---
    def set_address
      @address = current_user.addresses.find(params[:id])